{
  "description": "There is arguably no Starfleet officer more earnest and more eager for adventure than Dr Julian Bashir, the chief medical officer aboard the Federation space station Deep Space 9. In fact it is that spirit of adventure that pushes him to request the posting, calling DS9 “one of the most remote outposts available”.\nHis eagerness, however, takes some getting used to, a bit like an overly boisterous puppy, but the sincerity of his motivations means you soon get to love him, even if his self confidence and self belief can sometimes border on arrogance, albeit far from malicious or snobbish.\nBashir is incredibly intelligent, but it is later revealed his intelligence is a result of genetic augmentation. As a child, Bashir was academically slower than his peers, and so out of concern his parents had his DNA resequenced to give him better life chances, a procedure made illegal following the Eugenics Wars and the emergence of the highly dangerous, genetically engineered criminal Khan Noonien Singh.\nLife aboard DS9 affords Bashir not only the opportunity to study what he refers to as “real frontier medicine” but also to foment deep and lasting relationships, not the least of which is his abiding friendship with the station’s chief of operations Miles O’Brien. Like most people, Miles found Bashir a bit much at the beginning, but eventually the two became inseparable.\nBashir’s most intriguing friendship, however, is with DS9’s resident Cardassian tailor and former intelligence operative, Elim Garak. Drawn into Garak’s fascinating web like an exceptionally keen fly, Bashir is teased with potentially explosive, but also potentially untrue, tidbits about the Cardassian’s life and connections, information that feeds heavily into Bashir’s desire to be an actual James Bond in real life.\nAt his core, though, Julian Bashir is a doctor, a carer. He believes deeply in the sanctity of life, will work tirelessly to save the life of both friend and foe, and wouldn’t think twice about putting someone else’s life before his own. Bashir is the Hippocratic Oath personified",
  "ability_info": {
    "below_decks_ability": null,
    "captain_maneuver": {
      "name": "Surgical Precision",
      "bonus": "Julian Bashir increases Critical Hit Damage by {value} against Solo Armadas.",
      "percentage": true,
      "value": 0.5
    },
    "officer_ability": {
      "name": "Steady Hand",
      "bonus": "Julian Bashir increases Critical Hit Chance by {value} against Solo Armadas.",
      "percentage": true
    }
  },
  "class": "science",
  "faction": "federation",
  "group": "deep space nine",
  "img_url": "./assets/julian_bashir.png",
  "officer_name": "Julian Bashir",
  "ranks": [
    {
      "name": "ENSIGN I",
      "officer_ability_value": 0.2,
      "rank_id": 1,
      "requirements": {
        "badges": 0,
        "credits": 0,
        "others": [],
        "shards": 40,
        "xp": 0
      }
    },
    {
      "name": "LIEUTENANT JG II",
      "officer_ability_value": 0.25,
      "rank_id": 2,
      "requirements": {
        "badges": 0,
        "credits": 0,
        "others": [],
        "shards": 40,
        "xp": 10000
      }
    },
    {
      "name": "LIEUTENANT III",
      "officer_ability_value": 0.35,
      "rank_id": 3,
      "requirements": {
        "badges": 0,
        "credits": 1100,
        "others": [],
        "shards": 100,
        "xp": 100000
      }
    },
    {
      "name": "LT. COMMANDER IV",
      "officer_ability_value": 0.45,
      "rank_id": 4,
      "requirements": {
        "badges": 1,
        "credits": 4500,
        "others": [],
        "shards": 180,
        "xp": 250000
      }
    },
    {
      "name": "COMMANDER V",
      "officer_ability_value": 0.6,
      "rank_id": 5,
      "requirements": {
        "badges": 2,
        "credits": 11500,
        "others": [],
        "shards": 190,
        "xp": 500000
      }
    }
  ],
  "rarity": "rare",
  "synergy": {
    "command": 0.5,
    "engineering": 0.5,
    "science": 0.25
  },
  "traits": [
    {
      "name": "Doctor",
      "levels": [
        {
          "level": 1,
          "trait_xp": 1500
        },
        {
          "level": 2,
          "trait_xp": 2700
        },
        {
          "level": 3,
          "trait_xp": 3800
        }
      ],
      "tier": 1
    },
    {
      "name": "Cautious",
      "levels": [
        {
          "level": 1,
          "trait_xp": 7650
        },
        {
          "level": 2,
          "trait_xp": 6000
        },
        {
          "level": 3,
          "trait_xp": 7000
        },
        {
          "level": 4,
          "trait_xp": 8850
        }
      ],
      "tier": 2
    }
  ]
}
