{
  "description": "The vast majority of those who make up the overwhelming numbers of the Borg were not born into the Collective. At one point in time, they were all individuals with their own unique lives, hopes and aspirations. Two of Eleven, known in their former life as Darrohk, was one of those individuals.\n\nAt the height of their military career, Darrohk was a commanding officer aboard the Lhohnu - a shining jewel in the Romulan Star Empire's mining fleet. At one point in time, the Lhohnu oversaw the acquisition of more than twenty percent of the Empire’s entire Dilithium reserves. Specializing in mining expeditions in some of the more tumultuous and dangerous systems in the galaxy, Darrohk and their fellow crew aboard the Lhohnu were a force to be reckoned with in the excavation business.\n\nIt was during one of these fateful runs to an outlying system where Darrohk would first encounter the Borg. The Borg’s attack was swift and merciless, with the entire crew of the Lhohnu apprehended and assimilated into the Collective in a matter of minutes. It wasn’t long until Darrohk, now known as Two of Eleven, was assisting the Collective in apprehending and assimilating their former Romulan brothers and sisters.\n\nHowever, Two of Eleven's time in the Collective was to be cut short when, after successfully holding back the Mega Cube, the Romulans were able to liberate them and thousands of other Borg drones from the Collective. While their time in the Collective was brief, they would go on to bear the physical and mental scars of their experiences with the Borg - experiences that would make it impossible to ever resume a normal life. Instead, Two of Eleven found solace in Letik and her congregation, and would go on to assist them in their Doomsday plot. Tragically, it was only a matter of time until Two of Eleven's augmented body began to suffer the effects of the reclamation effort. Considered nothing more than a hindrance, they were now abandoned by Letik and her followers.\n\nCastigated by modern Romulan society, and abandoned by Letik and her cabal of Doomsday conspirators, Two of Eleven now finds themself alone in a galaxy that has wrought an abundance of hardships upon them. However, this ever-resourceful Romulan will persevere, refusing to buckle under the weight of a fate they never asked for.",
  "ability_info": {
    "below_decks_ability": null,
    "captain_maneuver": {
      "name": "Storage Optimization",
      "bonus": "Two of Eleven increases the Cargo size of the ship by {value}.",
      "percentage": true,
      "value": 0.2
    },
    "officer_ability": {
      "name": "Extraction Protocol",
      "bonus": "Two of Eleven increases the rate of Crystal, Gas, and Ore Mining by {value}.",
      "percentage": true
    }
  },
  "class": "science",
  "faction": "borg",
  "group": "unimatrix twelve",
  "img_url": "./assets/two_of_eleven.png",
  "officer_name": "Two of Eleven",
  "ranks": [
    {
      "name": "ENSIGN I",
      "officer_ability_value": 0.5,
      "rank_id": 1,
      "requirements": {
        "badges": 0,
        "credits": 0,
        "others": [],
        "shards": 40,
        "xp": 0
      }
    },
    {
      "name": "LIEUTENANT JG II",
      "officer_ability_value": 0.55,
      "rank_id": 2,
      "requirements": {
        "badges": 0,
        "credits": 0,
        "others": [
          {
            "name": "Active Nanoprobe",
            "value": 3000
          }
        ],
        "shards": 65,
        "xp": 0
      }
    },
    {
      "name": "LIEUTENANT III",
      "officer_ability_value": 0.6,
      "rank_id": 3,
      "requirements": {
        "badges": 1,
        "credits": 1300,
        "others": [
          {
            "name": "Active Nanoprobe",
            "value": 25000
          }
        ],
        "shards": 125,
        "xp": 0
      }
    },
    {
      "name": "LT. COMMANDER IV",
      "officer_ability_value": 0.65,
      "rank_id": 4,
      "requirements": {
        "badges": 2,
        "credits": 5200,
        "others": [
          {
            "name": "Active Nanoprobe",
            "value": 100000
          }
        ],
        "shards": 170,
        "xp": 0
      }
    },
    {
      "name": "COMMANDER V",
      "officer_ability_value": 0.75,
      "rank_id": 5,
      "requirements": {
        "badges": 4,
        "credits": 13000,
        "others": [
          {
            "name": "Active Nanoprobe",
            "value": 500000
          }
        ],
        "shards": 250,
        "xp": 0
      }
    }
  ],
  "rarity": "rare",
  "synergy": {
    "command": 0.15,
    "engineering": 0.15,
    "science": 0.05
  },
  "traits": [
    {
      "name": "Assimilated",
      "levels": [
        {
          "level": 1,
          "trait_xp": 1500
        },
        {
          "level": 2,
          "trait_xp": 2700
        },
        {
          "level": 3,
          "trait_xp": 3800
        }
      ],
      "tier": 1
    },
    {
      "name": "Cybernetic",
      "levels": [
        {
          "level": 1,
          "trait_xp": 7650
        },
        {
          "level": 2,
          "trait_xp": 6000
        },
        {
          "level": 3,
          "trait_xp": 7000
        },
        {
          "level": 4,
          "trait_xp": 8850
        }
      ],
      "tier": 2
    }
  ]
}
